Repository: DenProff/IELTSAppProject
Catalog: Resources/Resources.*.resx
Languages: es, zh_cn

# accept
source: Принять
zh_cn: 接受

# addToCollection
source: Добавить в подборку
es: Añadir a colección
zh_cn: 添加到收藏集

# answerFileMistake
source: Файл записи не найден, это ошибка, приносим свои извинения.
es: Archivo de grabación no encontrado, disculpe el error
zh_cn: 未找到录音文件，我们为此错误深表歉意

# answerIsSaved
source: Ответ сохранён.
es: Respuesta guardada
zh_cn: 答案已保存

# avargeScore
source: Средний балл:
zh_cn: 平均分数：

# checkAll
source: Проверить всё
es: Verificar todo
zh_cn: 检查全部

# chiLanguage
source: Китайский
es: Chino
zh_cn: 中文

# chooseCurrentLanguage
source: Выберите язык, на котором вы хотите работать в приложении
es: Selecciona el idioma que deseas usar en la aplicación
zh_cn: 选择您想在应用中使用的语言

# chooseLanguage
source: Выбор языка
es: Selección de idioma
zh_cn: 语言选择

# chooseModeTextBlock
source: Выберите нужный режим
es: Selecciona el modo deseado
zh_cn: 选择所需模式

# convertBTN
source: Конвертировать в docx
es: Convertir a docx
zh_cn: 转换为docx

# deleteCollection
source: Удалить
zh_cn: 删除

# describeTextBlockFirstTestPage
source: Для начала работы советуем вам пройти входное тестирование, чтобы мы могли собрать статистику и вы увидели какие задания у вас получаются хуже. Если вы уже решали входной тест, можете продолжить работу с нужными вам заданиями
es: Recomendamos comenzar con un test de nivel para recopilar estadísticas e identificar tus áreas débiles. Si ya lo has realizado, puedes practicar tareas específicas
zh_cn: 我们建议从分级测试开始，以便收集数据并找出您的薄弱环节。如果您已完成测试，可以直接练习特定题型

# dialogBoxMessage
source: Введите название новой персональной подборки:
zh_cn: 输入新个人收藏集名称:

# engLanguage
source: Английский
es: Inglés
zh_cn: 英语

# EnterAnswerHere
source: Введите свой ответ сюда.
es: Ingrese su respuesta aquí
zh_cn: 在此输入您的答案

# EnterAnswerHereMessage
source: Запишите свой ответ здесь:
es: Escribe tu respuesta aquí:
zh_cn: 在此输入您的答案：

# espLanguage
source: Испанский
es: Español
zh_cn: 西班牙语

# examsStatistics
source: Статистика по сданным экзаменам:
zh_cn: 考试统计：

# fewTimeBeforeExam
source: У меня мало времени до экзамена!
es: ¡Tengo poco tiempo antes del examen!
zh_cn: 我考试前时间不多了！

# findForPupils
source: Найти задания для своих учеников
es: Encontrar tareas para tus alumnos
zh_cn: 为您的学生查找任务

# help
source: Помощь
es: Ayuda
zh_cn: 帮助

# IELTSvariants
source: Варианты экзамены IELTS
es: Versiones del IELTS
zh_cn: 雅思套题

# mainCatalog
source: Основной каталог заданий
es: Catálogo principal de tareas
zh_cn: 主要任务目录

# mainScreen
source: На главный экран
es: A la pantalla principal
zh_cn: 返回主屏幕

# myCollections
source: Мои подборки заданий
es: Mis colecciones de tareas
zh_cn: 我的任务集

# myMistakes
source: Мои ошибки
es: Mis errores
zh_cn: 我的错误

# myStatistics
source: Моя статистика
es: Mis estadísticas
zh_cn: 我的统计数据

# nothingIsPlaying
source: Сейчас ничего не проигрывается.
es: No se está reproduciendo nada actualmente
zh_cn: 当前没有播放内容

# notSolveEnterVariantBTN
source: Работать по своему усмотрению (не решать входной вариант)
es: Modo personalizado (omitir test de nivel)
zh_cn: 自定义练习模式（跳过分级测试）

# passedExamsQuantity
source: Количество сданных экзаменов:
zh_cn: 已完成考试数量：

# PDFmistake
source: Не удалось открыть PDF с критериями.
es: Error al abrir el PDF con criterios
zh_cn: 无法打开评分标准PDF文件

# playIdealAnswer
source: Играть пример на макс. балл
es: Reproducir respuesta modelo
zh_cn: 播放满分范例

# playingWasStopped
source: Воспроизведение остановлено.
es: Reproducción detenida
zh_cn: 播放已停止

# playOrPause
source: Играть/Пауза
es: Reproducir/Pausa
zh_cn: 播放/暂停

# playUserAnswer
source: Играть свою запись
es: Reproducir tu grabación
zh_cn: 播放您的录音

# prevPage
source: Вернуться назад
es: Volver atrás
zh_cn: 返回

# recomendedTime
source: Рекомендованное время:
es: Duración sugerida:
zh_cn: 推荐时长:

# recommendToWorkOn
source: Рекомендуется поработать над:
zh_cn: 推荐练习：

# recordAnswerFirst
source: Сначала запишите свой ответ.
es: Graba tu respuesta primero
zh_cn: 请先录制您的答案

# recordingEnableOnlyAfterSettingAnswer
source: Запись можно проиграть после добавления ответа.
es: La grabación solo se puede reproducir después de agregar una respuesta.
zh_cn: 只有在添加答案后才能播放录音。

# recordingInProgress
source: Запись идёт.
es: Grabación en curso
zh_cn: 正在录音中

# recordingNotStartedMessage
source: Запись ещё не начата.
es: La grabación aún no ha comenzado.
zh_cn: 录音尚未开始。

# refuse
source: Отмена
zh_cn: 取消

# remindToChooseTopic
source: Перед написанием эссе не забудте выбрать тему выше
es: No olvide seleccionar un tema antes de escribir su ensayo
zh_cn: 在写作文前请记得选择题目

# remindToChooseTopicMessageBox
source: Перед данным действием необходимо выбрать тему
es: Debe seleccionar un tema antes de esta acción
zh_cn: 进行此操作前需要先选择题目

# ResAndMaxPointsMessage
source: Результат и пример на макс. балл:
es: Tu resultado y respuesta modelo:
zh_cn: 您的答案和满分范例：

# rusLanguage
source: Русский
es: Ruso
zh_cn: 俄语

# saveAnswer
source: Сохранить ответ
es: Guardar respuesta
zh_cn: 保存答案

# saveTopicChoice
source: Сохранить выбор темы
es: Guardar selección de tema
zh_cn: 保存题目选择

# SeeEvaluationCriteria
source: Посмотреть критерии оценивания
es: Ver criterios de evaluación
zh_cn: 查看评分标准

# selfCheck
source: Самопроверка
zh_cn: 自我检查

# showEnableOnlyAfterAnswering
source: Просмотр эссе можно будет выполнять только после сохранения собственного
es: La visualización de ensayos solo está disponible después de guardar el suyo
zh_cn: 只有在保存您的作文后才能查看范文

# showMaxEssay
source: Смотреть эссе на макс.
es: Ver ensayo con puntuación máxima
zh_cn: 查看满分范文

# showUserEssay
source: Смотреть своё эссе
es: Ver su ensayo
zh_cn: 查看您的作文

# solveEnterVariantBTN
source: Решать входной вариант
es: Realizar test de nivel
zh_cn: 参加分级测试

# solveIELTSformat
source: Решать готовые варианты в формате IELTS
es: Practicar exámenes completos en formato IELTS
zh_cn: 练习完整雅思模拟试题

# startOrContinuePreporation
source: Начать (продолжить) подготовку
es: Empezar (continuar) la preparación
zh_cn: 开始（继续）准备

# startRecording
source: Запись
es: Comenzar grabación
zh_cn: 开始录音

# stop
source: Стоп
es: Detener
zh_cn: 停止

# tasksByType
source: Задания по разделам (Listening, Reading, Speaking, Writing)
es: Tareas por sección (Listening, Reading, Speaking, Writing)
zh_cn: 按题型分类练习 (听力、阅读、口语、写作)

# tasksStatisicsPart1
source: Количество успешно/неуспешно
zh_cn: 按类别统计成功/失败

# tasksStatisicsPart2
source: выполненных заданий по категориям:
zh_cn: 完成的任务数量：

# taskType
source: Вид заданий:
es: Clase de ejercicios
zh_cn: 题目种类

# taskTypes
source: Виды заданий
es: Tipos de tareas
zh_cn: 任务类型

# UserAndIdealAnswersAreEnable
source: Можно слушать свой и пример идеального варианты ответа.
es: Puedes escuchar tanto tu respuesta como la respuesta modelo
zh_cn: 您可以收听自己的答案和范例答案

# UserDidNotChooseTopic
source: Вы не выбрали тему!
es: ¡No has seleccionado un tema!
zh_cn: 您还未选择题目！

# variantName
source: Название подборки:
zh_cn: 收藏集名称:

# welcomeTextBlock
source: Добро пожаловать в приложение для подготовки к экзамену в формате IELTS
es: Bienvenido a la aplicación de preparación para el examen IELTS
zh_cn: 欢迎使用IELTS考试准备应用
