[
  {
    "TaskType": "ReadingTask",
    "id": 1,
    "TextForReading": "You should spend about 20 minutes on Questions. Read the texts below and answer the following questions",
    "Task1": "The Vitamin Shoppe has an above average salary, according to the review.",
    "Task2": "Advantage Sales & Marketing owns 65 offices all over the world",
    "Task3": "Universal Protection Service offers various security services in the USA.",
    "Task4": "Reviewer of the PSA Healthcare praises its high wages.",
    "Task5": "None of the offers included an approximate salary in the description.",
    "Task6": "Which offer has the most part-time openings?",
    "Task7": "Which of these companies operate both in USA and Canada?",
    "Task8": "Main office of which company is situated in Atlanta?",
    "Task9": "VitaPath is the other name of which company?",
    "Task0": "Which review doesn’t mention a comfortable timetable?",
    "TaskAnswerList6": [ "Chipotle", "PSA Healthcare", "The Vitamin Shoppe" ],
    "TaskAnswerList7": [ "The Vitamin Shoppe and Advantage Sales & Marketing", "PSA Healthcare and Advantage Sales & Marketing", "Chipotle and PSA Healthcare" ],
    "TaskAnswerList8": [ "The Vitamin Shoppe", "PSA Healthcare", "Chipotle" ],
    "TaskAnswerList9": [ "PSA Healthcare", "Universal Protection Service", "The Vitamin Shoppe" ],
    "TaskAnswerList0": [ "Chipotle", "Advantage Sales & Marketing", "The Vitamin Shoppe" ],
    "Answer": [
      "True",
      "False",
      "True",
      "Not Stated",
      "True",
      "The Vitamin Shoppe",
      "The Vitamin Shoppe and Advantage Sales & Marketing",
      "PSA Healthcare",
      "The Vitamin Shoppe",
      "The Vitamin Shoppe"
    ],
    "UserAnswer": null,
    "TaskText": "1. The Vitamin Shoppe: 1,946 part-time openings. The Vitamin Shoppe is a New Jersey-based retailer of nutritional supplements. They also operate stores in Canada under the name \"VitaPath\". The company provides approximately 8,000 different SKU's of supplements through its retail stores and over 20,000 different SKU's of supplements through its online retail websites.\nEmployee Review: Good growth opportunities and stores opening all over the US all year 'round. Company based out of NJ, so more progressive policies on employment and benefits. Good vacation, health, and dental benefits. Payment is above average. Good policies on customer service interaction as well. Focus on Customer service vs. pushing products.\n\n2. Chipotle: 1,553 part-time openings.Chipotle is known for its use of organic meats throughout its more than 1,500 restaurants, which are located in 45 states. Since having been founded in 1993, the chain has since exploded and now counts some 37,000 employees. It is a pioneer in the \"fast casual\" dining movement.\nEmployee Review: The people I work with are awesome and the food is good. It pays my bills and makes me laugh. The schedule is super flexible but it's a lot of work. If you're looking for something easy and laid back, keep looking.\n\n3. Advantage Sales & Marketing: 1,742 part-time openings.Advantage Sales & Marketing provides outsourced sales, merchandising, and marketing services to consumer goods and food product manufacturers and suppliers. Owning more than 65 offices in the US and Canada, ASM does merchandising for 1,200 clients -- including Johnson & Johnson, Mars, Unilever, Energizer.\nEmployee Review: Long lasting business, able to adapt to changes in market. Well-thought out schedule, and flexible time off for both vacation and illness.\n\n4. Universal Protection Service: 1,219 part-time openings.Universal Protection Service is one of the largest providers of security services in the U.S. They offer an expansive range of security solutions for airports, healthcare facilities, office buildings, and more.\nEmployee Review: Good pay depending on where you work. Room for advancement based on availability. Better company than any other I have worked for in security.\n\n5. PSA Healthcare: 1,295 part-time openingsPSA Healthcare, also known as Pediatric Services of America, provides comprehensive home health services through a branch of office across the United States. The company is headquartered in Atlanta, Ga.\nEmployee Review: I love working one-on-one with the pediatric patient and their families. You have the time needed to give great compassionate care! Office staff and supervisors are very good with both employees and clients. There is a lot of flexibility with staffing. I never received grief for requesting a day off.",
    "RecommendedTime": 20.0,
    "WithMistake": false
  },
    {
        "TaskType": "ListeningTask",
        "id": 2,
        "AudioPath": "cocoJambo.mp3",
        "Task1": "1. According to the speaker, what will be the most likely cause of a global catastrophe in the near future?",
        "Task2": "2. What is the main issue with the disease prevention system?",
        "Task3": "3. Which organization is funded to monitor epidemics?",
        "Task4": "4. Which fortunate condition prevented Ebola from spreading further?",
        "Task5": "5. How can people's movements be monitored nowadays?",
        "Task6": "6. NATO has a ______ that is always ready to go.",
        "Task7": "7. Among the key pieces are ______ in underprivileged countries.",
        "Task8": "8. To get the military ready for action we need to run ______ and detect problem areas.",
        "Task9": "9. The speaker can't give a/an ______ for the cost of medical research.",
        "Task0": "10. The World Bank predicts that in case of a global pandemic the ______ will be drastically reduced.",
        "TaskAnswerList1": [ "A. A nuclear war", "B. A global pandemic", "C. A natural disaster" ],
        "TaskAnswerList2": [ "A. It exists, but functions poorly", "B. It doesn't exist at all", "C. It only exists in certain countries" ],
        "TaskAnswerList3": [ "A. The WHO", "B. The UN", "C. Médecins Sans Frontières" ],
        "TaskAnswerList4": [ "A. A cure was found quickly", "B. People were provided with protective gear", "C. The virus did not spread through urban areas" ],
        "TaskAnswerList5": [ "A. Through satellite maps", "B. Through street camera", "C. Through cell phones" ],
        "Answer": [ "B", "B", "A", "C", "A", "mobile unit", "strong health systems", "simulations", "exact budget", "global wealth" ],
        "UserAnswer": null,
        "TaskText": "Listen to the lecture-presentation ONCE and complete the following tasks.",
        "RecommendedTime": 52.0,
        "WithMistake": false
    }
]